manabian/linux-lpc/arch/arm/mach-lpc2k/include/mach/mfp-lpc24xx.h
/*
 * Copyright 2011 Team Embedded VOF
 *     Ithamar R. Adema <ihamar.adema@team-embedded.nl>
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 */

#ifndef MACH_LPC2K_MFP_LPC24XX_H
#define MACH_LPC2K_MFP_LPC24XX_H

#include <mach/mfp.h>

#define P0_0_RD1		MFP_CFG(LPC2K_GPIO(0,0), AF1)
#define P0_0_TXD3		MFP_CFG(LPC2K_GPIO(0,0), AF2)
#define P0_0_SDA1		MFP_CFG(LPC2K_GPIO(0,0), AF3)
#define P0_1_TD1		MFP_CFG(LPC2K_GPIO(0,1), AF1)
#define P0_1_RXD3		MFP_CFG(LPC2K_GPIO(0,1), AF2)
#define P0_1_SCL1		MFP_CFG(LPC2K_GPIO(0,1), AF3)
#define P0_2_TXD0		MFP_CFG(LPC2K_GPIO(0,2), AF1)
#define P0_3_RXD0		MFP_CFG(LPC2K_GPIO(0,3), AF1)
#define P0_4_LCDVD0		MFP_CFG(LPC2K_GPIO(0,4), AF1)
#define P0_5_LCDVD1		MFP_CFG(LPC2K_GPIO(0,5), AF1)
#define P0_6_LCDVD8		MFP_CFG(LPC2K_GPIO(0,6), AF1)
#define P0_7_LCDVD9		MFP_CFG(LPC2K_GPIO(0,7), AF1)
#define P0_8_LCDVD16		MFP_CFG(LPC2K_GPIO(0,8), AF1)
#define P0_9_LCDVD17		MFP_CFG(LPC2K_GPIO(0,9), AF1)
#define P0_10_TXD2		MFP_CFG(LPC2K_GPIO(0,10), AF1)
#define P0_11_RXD2		MFP_CFG(LPC2K_GPIO(0,11), AF1)
#define P0_12_USB_PPWR2		MFP_CFG(LPC2K_GPIO(0,12), AF1)
#define P0_13_USB_UP_LED2	MFP_CFG(LPC2K_GPIO(0,13), AF1)
#define P0_15_SCK		MFP_CFG(LPC2K_GPIO(0,15), AF3)
#define P0_17_MISO		MFP_CFG(LPC2K_GPIO(0,17), AF3)
#define P0_18_MOSI		MFP_CFG(LPC2K_GPIO(0,18), AF3)
#define P0_27_SDA0		MFP_CFG(LPC2K_GPIO(0,27), AF1)
#define P0_28_SCL0		MFP_CFG(LPC2K_GPIO(0,28), AF1)
#define P0_29_USB_Dp1		MFP_CFG(LPC2K_GPIO(0,29), AF1)
#define P0_30_USB_Dn1		MFP_CFG(LPC2K_GPIO(0,30), AF1)
#define P0_31_USB_Dp2		MFP_CFG(LPC2K_GPIO(0,31), AF1)
#define P1_0_ENET_TXD0		MFP_CFG(LPC2K_GPIO(1,0), AF1)
#define P1_1_ENET_TXD1		MFP_CFG(LPC2K_GPIO(1,1), AF1)
#define P1_2_MCICLK		MFP_CFG(LPC2K_GPIO(1,2), AF2)
#define P1_3_MCICMD		MFP_CFG(LPC2K_GPIO(1,3), AF2)
#define P1_4_ENET_TX_EN		MFP_CFG(LPC2K_GPIO(1,4), AF1)
#define P1_5_MCIPWR		MFP_CFG(LPC2K_GPIO(1,5), AF2)
#define P1_6_ENET_TX_CLK	MFP_CFG(LPC2K_GPIO(1,6), AF1)
#define P1_6_MCIDAT0		MFP_CFG(LPC2K_GPIO(1,6), AF2)
#define P1_7_MCIDAT1		MFP_CFG(LPC2K_GPIO(1,7), AF2)
#define P1_8_ENET_CRS		MFP_CFG(LPC2K_GPIO(1,8), AF1)
#define P1_9_ENET_RXD0		MFP_CFG(LPC2K_GPIO(1,9), AF1)
#define P1_10_ENET_RXD1		MFP_CFG(LPC2K_GPIO(1,10), AF1)
#define P1_11_MCIDAT2		MFP_CFG(LPC2K_GPIO(1,11), AF2)
#define P1_12_MCIDAT3		MFP_CFG(LPC2K_GPIO(1,12), AF2)
#define P1_14_ENET_RX_ERR	MFP_CFG(LPC2K_GPIO(1,14), AF1)
#define P1_15_ENET_REF_CLK	MFP_CFG(LPC2K_GPIO(1,15), AF1)
#define P1_16_ENET_MDC		MFP_CFG(LPC2K_GPIO(1,16), AF1)
#define P1_17_ENET_MDIO		MFP_CFG(LPC2K_GPIO(1,17), AF1)
#define P1_18_PWM1		MFP_CFG(LPC2K_GPIO(1,18), AF2)
#define P1_20_LCDVD10		MFP_CFG(LPC2K_GPIO(1,20), AF1)
#define P1_21_LCDVD11		MFP_CFG(LPC2K_GPIO(1,21), AF1)
#define P1_22_LCDVD12		MFP_CFG(LPC2K_GPIO(1,22), AF1)
#define P1_23_LCDVD13		MFP_CFG(LPC2K_GPIO(1,23), AF1)
#define P1_24_LCDVD14		MFP_CFG(LPC2K_GPIO(1,24), AF1)
#define P1_25_LCDVD15		MFP_CFG(LPC2K_GPIO(1,25), AF1)
#define P1_26_LCDVD20		MFP_CFG(LPC2K_GPIO(1,26), AF1)
#define P1_27_LCDVD21		MFP_CFG(LPC2K_GPIO(1,27), AF1)
#define P1_28_LCDVD22		MFP_CFG(LPC2K_GPIO(1,28), AF1)
#define P1_29_LCDVD23		MFP_CFG(LPC2K_GPIO(1,29), AF1)
#define P1_30_VBUS		MFP_CFG(LPC2K_GPIO(1,30), AF2)
#define P1_31_USB_OVRCR2	MFP_CFG(LPC2K_GPIO(1,31), AF1)
#define P2_0_LCDPWR		MFP_CFG(LPC2K_GPIO(2,0), AF3)
#define P2_1_LCDLE		MFP_CFG(LPC2K_GPIO(2,1), AF3)
#define P2_2_LCDDCLK		MFP_CFG(LPC2K_GPIO(2,2), AF3)
#define P2_3_LCDFP		MFP_CFG(LPC2K_GPIO(2,3), AF3)
#define P2_4_LCDM		MFP_CFG(LPC2K_GPIO(2,4), AF3)
#define P2_5_LCDLP		MFP_CFG(LPC2K_GPIO(2,5), AF3)
#define P2_6_LCDVP4		MFP_CFG(LPC2K_GPIO(2,6), AF3)
#define P2_7_LCDVP5		MFP_CFG(LPC2K_GPIO(2,7), AF3)
#define P2_8_LCDVP6		MFP_CFG(LPC2K_GPIO(2,8), AF3)
#define P2_9_LCDVP7		MFP_CFG(LPC2K_GPIO(2,9), AF3)
#define P2_11_LCDCLKIN		MFP_CFG(LPC2K_GPIO(2,11), AF1)
#define P2_12_LCDVP18		MFP_CFG(LPC2K_GPIO(2,12), AF1)
#define P2_13_LCDVP19		MFP_CFG(LPC2K_GPIO(2,13), AF1)
#define P3_16_TXD1		MFP_CFG(LPC2K_GPIO(3,16), AF3)
#define P3_17_RXD1		MFP_CFG(LPC2K_GPIO(3,17), AF3)
#define P3_18_CTS1		MFP_CFG(LPC2K_GPIO(3,18), AF3)
#define P3_19_DCD1		MFP_CFG(LPC2K_GPIO(3,19), AF3)
#define P3_20_DSR1		MFP_CFG(LPC2K_GPIO(3,20), AF3)
#define P3_21_DR1		MFP_CFG(LPC2K_GPIO(3,21), AF3)
#define P3_22_RI1		MFP_CFG(LPC2K_GPIO(3,22), AF3)
#define P3_30_RTS1		MFP_CFG(LPC2K_GPIO(3,30), AF3)
#define P4_28_TXD3		MFP_CFG(LPC2K_GPIO(4,28), AF3)
#define P4_28_LCDVP2		MFP_CFG(LPC2K_GPIO(4,28), AF2)
#define P4_29_RXD3		MFP_CFG(LPC2K_GPIO(4,29), AF3)
#define P4_29_LCDVP3		MFP_CFG(LPC2K_GPIO(4,29), AF2)

#endif /* MACH_LPC2K_MFP_LPC24XX_H */
